yang-8/run/scalarSimpleFoam/DominikFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    /*  0 */ (0 0 0)
    /*  1 */ (18 0 0)
    /*  2 */ (0 1 0)
    /*  3 */ (18 1 0)
    /*  4 */ (0 3 0)
    /*  5 */ (18 3 0)
    /*  6 */ (0 9 0)
    /*  7 */ (18 9 0)
    /*  8 */ (0 11 0)
    /*  9 */ (18 11 0)
    /* 10 */ (0 12 0)
    /* 11 */ (18 12 0)

    /* 12 */ (0 0 0.1)
    /* 13 */ (18 0 0.1)
    /* 14 */ (0 1 0.1)
    /* 15 */ (18 1 0.1)
    /* 16 */ (0 3 0.1)
    /* 17 */ (18 3 0.1)
    /* 18 */ (0 9 0.1)
    /* 19 */ (18 9 0.1)
    /* 20 */ (0 11 0.1)
    /* 21 */ (18 11 0.1)
    /* 22 */ (0 12 0.1)
    /* 23 */ (18 12 0.1)
);

blocks
(
    hex (0 1 3 2 12 13 15 14) (180 10 1) simpleGrading (1 1 1)
    hex (2 3 5 4 14 15 17 16) (180 20 1) simpleGrading (1 1 1)
    hex (4 5 7 6 16 17 19 18) (180 60 1) simpleGrading (1 1 1)
    hex (6 7 9 8 18 19 21 20) (180 20 1) simpleGrading (1 1 1)
    hex (8 9 11 10 20 21 23 22) (180 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (6 8 20 18)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 5 17 15)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
            (0 2 14 12)
            (2 4 16 14)
            (4 6 18 16)
            (8 10 22 20)

            (1 3 15 13)
            (5 7 19 17)
            (7 9 21 19)
            (9 11 23 21)

            (0 1 13 12)
            (10 11 23 22)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 2 3 1)
            (2 4 5 3)
            (4 6 7 5)
            (6 8 9 7)
            (8 10 11 9)

            (12 14 15 13)
            (14 16 17 15)
            (16 18 19 17)
            (18 20 21 19)
            (20 22 23 21)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
